<?php

use Illuminate\Database\Seeder;
use App\V2\Post;

class CommitteesPostsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $posts = array("الرئيس", "نائبة الرئيس للشؤون السياسية", "نائبة الرئيس للشؤون الإدارية", "نائب الرئيس لشؤون الشباب", "نائب الرئيس للعمل الوطني", "امين سر", "مقرر", "عضو", "عضو مجلس قضاء", "منسق القضاء", "مسؤول البلديات", "مسؤول الخدمات", "مسؤول العلاقات العامة", "عضو المجلس السياسي", "منسق", "نائب منسق", "مسؤول", "متابع", "سكرتيرة خاصة", "مستشار", "مساعد امين سر", "جهاز أمانة السرّ", "مفوض عام المجلس التحكيمي", "عضو اصيل", "عضو رديف", "قلم أمانة سر المجلس", "مساعد منسق", "مندوب", "امين صندوق", "مسؤول الانضباط", "مساعد مقرر", "منسق قطاع مجلس أقضية (بيروت الاولى، جبيل، كسروان، المتن الشمالي)", "منسق قطاع مجلس أقضية (بيروت الثانية، بعبدا، عاليه، الشوف)", "منسق قطاع مجلس أقضية (البترون، الكورة، زغرتا، بشري )", "منسق قطاع مجلس أقضية (بعلبك-الهرمل، زحلة، البقاع الغربي، راشيا)", "منسق قطاع مجلس أقضية (جزين، صيدا، الزهراني، مرجعيون-حاصبيا، بنت جبيل-صور، النبطية)", "مقرر اللجنة القطاعية لهيئات الأقضية", "مساعد مقرر اللجنة القطاعية لهيئات الأقضية", "منسّق قطاع أقضية بيروت الثانية، بعبدا،عاليه الشوف", "منسّق قطاع أقضية بيروت الأولى، المتن، جبيل، كسروان", "منسّق قطاع أقضية عكارّ، المنية/الضنية، طرابلس", "منسّق قطاع أقضية البترون، الكورة، زغرتا، بشرّي", "منسّق قطاع أقضية بعلبك/الهرمل، زحلة، البقاع الغربي", "منسّق قطاع أقضية جزين، صيدا، الزهراني، مرجعيون/حاصبيا، بنت جبيل/صور", "عضو مساعد قطاع أقضية بيروت الثانية، بعبدا،عاليه الشوف", "مساعد منسّق قطاع أقضية بيروت الأولى، المتن، جبيل، كسروان", "عضو مساعد قطاع أقضية بيروت الأولى، المتن، جبيل، كسروان", "مساعد منسّق قطاع أقضية عكارّ، المنية/الضنية، طرابلس", "عضو مساعد قطاع أقضية عكارّ، المنية/الضنية، طرابلس", "عضو مساعد قطاع أقضية البترون، الكورة، زغرتا، بشرّي", "مساعد منسّق قطاع أقضية بعلبك/الهرمل، زحلة، البقاع الغربي", "عضو مساعد قطاع أقضية بعلبك/الهرمل، زحلة، البقاع الغربي", "مساعد منسّق قطاع أقضية جزين، صيدا، الزهراني، مرجعيون/حاصبيا، بنت جبيل/صور", "عضو مساعد قطاع أقضية جزين، صيدا، الزهراني، مرجعيون/حاصبيا، بنت جبيل/صور", "متابع قضاء قضاء بيروت 2", "متابع قضاء", "المحاسبة / الموازنة والتقارير", "مسؤول");

        foreach ($posts as $post){
            $p = new Post();
            $p->name = $post;
            $p->save();
        }

    }
}
