<?php

namespace App\Exports;

use Maatwebsite\Excel\Concerns\FromArray;

class MukhtarsTemplateExport implements FromArray
{
    public function array(): array
    {
        return [
            ['محافظة جبل لبنان', '', '', '', '', '', '', ''],
            ['اسم القضاء هنا', '', '', '', '', '', '', ''],
            ['اسم القرية', 'اسم الحي', 'اسم المرشح', 'عدد الأصوات', 'مرشح عن', 'الجوال', '', 'رقم الانتساب'],
            ['اسم القرية 1', 'اسم الحي (اختياري)', 'أنطوان يوسف', '600', 'مختار', '03123456', '', ''],
            ['', '', 'رامي فارس', '400', 'عضو اختياري', '70654321', '', 'نعم'],
        ];
    }
}
