<?php

namespace App\Exports;

use Maatwebsite\Excel\Concerns\FromArray;

class MunicipalityMembersTemplateExport implements FromArray
{
    public function array(): array
    {
        return [
            ['محافظة جبل لبنان', '', '', '', '', '', '', '', '', ''],
            ['اسم القضاء هنا', '', '', '', '', '', '', '', '', ''],
            ['اسم البلدية', '', 'اسم القرية', '', 'اسم العضو', 'عدد الأصوات', 'المنصب', 'رقم الهاتف', '', 'منتسب'],
            ['اسم البلدية 1', '', 'اسم القرية (اختياري)', '', 'محمد الأمين', '1200', 'رئيس', '03123456', '', ''],
            ['', '', '', '', 'سمير خليل', '950', 'نائب رئيس', '70654321', '', ''],
            ['', '', '', '', 'جورج حداد', '800', 'عضو', '', '', 'منتسب'],
        ];
    }
}
